I am unable to reproduce the issue with the configuration below.


* region : `us-east-1`/`us-east-2` for the topic
* I was able to provision the configuration on `1.2.0` and `1.3.0` of awscc provider.
* Configuration used

```
resource "awscc_chatbot_slack_channel_configuration" "alert_runners" {
  configuration_name = "alert-runners"
  iam_role_arn       = data.aws_iam_role.aws_chatbot_role.arn
  slack_workspace_id = "*****"   
  slack_channel_id   = "*****" 
  
  sns_topic_arns = ["arn:aws:sns:us-east-2:****:test"]
}

```

Apply:
```
data.aws_iam_role.aws_chatbot_role: Reading...
data.aws_iam_role.aws_chatbot_role: Read complete after 0s [id=Admin]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_chatbot_slack_channel_configuration.alert_runners will be created
  + resource "awscc_chatbot_slack_channel_configuration" "alert_runners" {
      + arn                = (known after apply)
      + configuration_name = "alert-runners"
      + guardrail_policies = (known after apply)
      + iam_role_arn       = "arn:aws:iam::############:role/Admin"
      + id                 = (known after apply)
      + logging_level      = "NONE"
      + slack_channel_id   = "****"
      + slack_workspace_id = "*****"
      + sns_topic_arns     = [
          + "arn:aws:sns:us-east-2:############:test",
        ]
      + tags               = (known after apply)
      + user_role_required = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_chatbot_slack_channel_configuration.alert_runners: Creating...
awscc_chatbot_slack_channel_configuration.alert_runners: Creation complete after 6s [id=arn:aws:chatbot::############:chat-configuration/slack-channel/alert-runners]

```


Additional scenarios tested:
- Created without tags
- Modified to include tags
- Removed tags from tagged configuration
- Re-applied